
/*
ver: 4.2a date: 2021.10.27
autor: Mikhail625@protonmail.com

                Tip: for formatting Ctrl + K, а затем Ctrl + D.
*/

/* Задания. Условия.
1. Требуется реализовать на C# функцию согласно блок-схеме. Блок-схема описывает алгоритм проверки, простое число или нет.
    Написать консольное приложение.
    Алгоритм реализовать отдельно в функции согласно блок-схеме.
    Написать проверочный код в main функции .
    Код выложить на GitHub.

2.  Посчитайте сложность функции

3.  Реализуйте функцию вычисления числа Фибоначчи
Требуется реализовать рекурсивную версию и версию без рекурсии (через цикл).

 */
namespace _001_lesson
{
    class Program
    {
        static void Main(string[] args)
        {          
            Dispatcher d1 = new Dispatcher();
            d1.Run("T1");
        } // end of Main()
    } // end of class Programm
} // end of name of space

