
/*
ver: 4.2a date: 2021.10.27
autor: Mikhail625@protonmail.com

1.                Tip: for formatting Ctrl + K, а затем Ctrl + D.
2. Удалить строку, в которой стоит курсор, можно с помощью Shift + Delete (при этом она копируется в буфер обмена).
*/

/* Задания. Условия.
1. Требуется реализовать на C# функцию согласно блок-схеме. Блок-схема описывает алгоритм проверки, простое число или нет.
    Написать консольное приложение.
    Алгоритм реализовать отдельно в функции согласно блок-схеме.
    Написать проверочный код в main функции .
    Код выложить на GitHub.

2.  Посчитайте сложность функции

3.  Реализуйте функцию вычисления числа Фибоначчи
Требуется реализовать рекурсивную версию и версию без рекурсии (через цикл).

 */
namespace Q2_Lesson_001
{
    class Program
    {
        static void Main(string[] args)
        {          
            Dispatcher dispatcherStart = new Dispatcher();
            dispatcherStart.Run("T1");
        } // end of Main()
    } // end of class Programm
} // end of name of space

